pages/13_Ridge_Routes_in_the_Land_of_The_Rising_Sun.html
<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml"
      xmlns:og="http://ogp.me/ns#"
      xmlns:fb="https://www.facebook.com/2008/fbml">
<head>
    <title>Ridge Routes in the Land of The Rising Sun.</title>
    <!-- Using the latest rendering mode for IE -->
    <meta http-equiv="X-UA-Compatible" content="IE=edge">
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">

    <!-- Open Graph tags -->

            <meta property="og:type" content="article"/>
            <meta property="og:title" content="Ridge Routes in the Land of The Rising Sun."/>
            <meta property="og:url" content="http://thecastle.github.io/thecastle/pages/13_Ridge_Routes_in_the_Land_of_The_Rising_Sun.html"/>

    <!-- Bootstrap -->
        <link rel="stylesheet" href="http://thecastle.github.io/thecastle/theme/css/bootstrap.readable.min.css" type="text/css"/>
    <link href="http://thecastle.github.io/thecastle/theme/css/font-awesome.min.css" rel="stylesheet">
    <link href="http://thecastle.github.io/thecastle/theme/css/pygments.css" rel="stylesheet">
    <link rel="stylesheet" href="http://thecastle.github.io/thecastle/theme/css/style.css" type="text/css"/>
    <!-- JavaScript plugins (requires jQuery) -->


</head>
<body>
<nav class="navbar navbar-default navbar-fixed-top" role="navigation">
    <div class="container">
        <div class="navbar-header">
            <button type="button" class="navbar-toggle" data-toggle="collapse" data-target=".navbar-ex1-collapse">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
                <span class="icon-bar"></span>
            </button>
            <a href="http://thecastle.github.io/thecastle" class="navbar-brand">The Castle Mountaineering Club.</a>
        </div>
        <div class="collapse navbar-collapse navbar-ex1-collapse">
            <ul class="nav navbar-nav">
            </ul>
            <ul class="nav navbar-nav navbar-right">
                <li><a href="http://thecastle.github.io/thecastle/archives.html"><i class="icon-th-list"></i>Archives</a></li>
            </ul>
        </div>
        <!-- /.navbar-collapse -->
    </div>
</nav>
<!-- /.navbar -->
<div class="container">
    <div class="row">
        <div class="col-lg-9">
    <section id="content" class="body">

        <div class="entry-content">
            
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Ridge Routes in the Land of The Rising Sun</h2>
<div class="outline-text-2" id="text-1">
<div class="export">
<p>
&lt;p&gt;
&lt;em&gt;by Dave Kime&lt;/em&gt;
&lt;/p&gt;
</p>

</div>

<p>
This area had long been neglected by the Club, although
older members could recall long days spent hacking through ivy on
exposed ridges and ascents of swaying trees. Spurred on by these
legends and by reports that chunks of stone were falling off some
of the routes, the Club held several meets in this area so close
and so unfamiliar to most Club members   the clubroom roof.
These meets were inaugurated by Sean, who unfortunately was
unable to ensure good weather. The first one was cancelled by an
eighteen inch snowfall and the second gave us a wonderful
experience of what it would be like to install a window in the
middle of Kinder Downfall. We had a chance to look at the roof
only very briefly while Andy indulged in the legendary pastime of
ivy clipping. We were by now a little more aware of the problems
we had to tackle and the committee set aside three further
Saturdays for the purpose.
</p>

<p>
Our next meet was somewhat exploratory but we found a number
of loose slates and a decaying chimney on the outside. Andy,
Charles and Frank constructed a spider&rsquo;s web between trees,
telegraph poles and the chimney stack and set about
reconstruction, whilst Dave and Tom prepared Ready Mix, filled
the gaping holes under the eaves and did some pointing. A
successful day, marred only by the sight of a forlorn starling
looking for the entrance to its nest next to the chimney stack.
The major problem then remaining was how best to stop the
mortar falling off the inside of the roof and annihilating the
members. We had many ideas but little real knowledge. However,
fate was kind and brought us a new member, Chris, who in a rash
moment admitted he was a builder and in an even rasher moment
volunteered to come on the next meet. Perhaps he had seen our new
chimney stack and realised that we were real craftsmen, or
perhaps he had seen the chimney stack and realised &#x2026;
</p>

<p>
Two weeks later we met again. The chimney was still standing
and Chris was very polite about our work but we hoped he wouldn&rsquo;t
look too closely. We were then shown how to use mortar trowels
and since this appeared so easy we got on with the job of
knocking down the eighteenth century mortar whilst Chris fixed
the slates on the roof with a total disregard for the ropes and
ladders with which we had festooned ourselves on the previous
meet. By lunch time the floor was deep in old mortar and we now
had to fill in the holes we had made. This was not as easy as
Chris had made out and a number of us resorted to mortar stuffing
by hand rather than by trowel. While Chris hung to the rafters by
his toe nails and mortared the higher reaches of the roof, Roger
swung from the planks and delivered well aimed dollops down the
neck of anyone who passed below. Andy swung across the walls on
an elaborate arrangement of slings and during his girdle traverse
of the clubroom demolished only two of the spotlights.
</p>

<p>
Mike and his son Mark joined us for the afternoon and while
Mike filled, Mark delivered pots of gunge to the inaccessible
corners of the clubroom. Disposal of the debris took quite some
time, as did the removal of Roger&rsquo;s wedges of mortar from our
spines. We had at least completed the work at the end of the
clubroom nearest the climbing wall which we now felt was a little
safer, even if the holds did require a dusting. A rather smaller
party met to deal with the remainder of the roof. With the
numbers available, we also managed to clear and re point two
sections above the upstairs room, which offered rather less of a
challenge than the previous week due to their accessibility.
Whenever we plan to work on  the roof, come along: it&rsquo;s great fun
and Your Club Needs You.
</p>

<p>
So, if you see a member in climbing gear with an ashen face
and a concrete helmet, he&rsquo;s probably just been climbing in the
Land of The Rising Sun.
</p>
</div>
</div>

        </div>
    </section>
        </div>
        <div class="col-lg-3 well well-sm" id="sidebar">

<aside>
    <section>

        <ul class="list-group list-group-flush">
             <li class="list-group-item"><h4><i class="icon-search icon-large"></i>Search</h4></li>

                   <li class="list-group-item"><h4><i class="icon-book icon-large"></i>Pages</h4></li>



                <li class="list-group-item"><a href="http://thecastle.github.io/thecastle/tags.html"><h4><i class="icon-tags icon-large"></i>Tags</h4></a></li>
        </ul>
    </section>
</aside>        </div>
    </div>
</div>
<footer>
    <div class="container">
        <hr>
        <p class="pull-right"><i class="icon-arrow-up"></i> <a href="#">Back to top</a></p>


        <p>&copy;  The Castle Mountaineering Club. &middot; Powered by <a href="https://github.com/DandyDev/pelican-bootstrap3" target="_blank">pelican-bootstrap3</a>,
            <a href="http://docs.getpelican.com/" target="_blank">Pelican</a>,
            <a href="http://getbootstrap.com" target="_blank">Bootstrap</a></p>
    </div>
</footer>
<!-- Include all compiled plugins (below), or include individual files as needed -->
<script src="http://thecastle.github.io/thecastle/theme/js/bootstrap.min.js"></script>

<!-- Enable responsive features in IE8 with Respond.js (https://github.com/scottjehl/Respond) -->
<script src="http://thecastle.github.io/thecastle/theme/js/respond.min.js"></script>


</body>
</html>